## SQLite Introduction

In this lecture we will be seeing that how can we connect with an SQLite database and how can we interact it with our python code. We will be the  'sqlite3' library.

In [1]:
import sqlite3
db = sqlite3.connect('IMDB.sqlite')
db

In the above code we have established a connection with the SQLite database. The function that we have used is connect() - takes the path of the database as input, returns a connection object that we can store in a variable.

If we pass the path of an object (that does not exist) in the connect() function -> We don't get any error. We get a random reference to which the connection object is pointing. The file (empty) with the specified name is created in the directory.

This is how we can create a new database. We can visualise the database with the help of any database browser.

In [2]:
db = sqlite3.connect('School.sqlite')
db

We have created a new database - School.sqlite

We should create a cursor object with the help of which we can execute SQL commands against our database.

In [3]:
cur = db.cursor()
cur

Created  the cursor object

In [4]:
sql_query = 'Create table Student (RollNumber int Primary Key, Name Text, Age int)'
cur.execute(sql_query)

We have created a new table in our database. In order to call a SQL query we need the method execute() to be called over the cursor object.

In [5]:
cur.execute('Insert into Student values (101, "Aman", 20)')
db.commit()

Here we have inserted rows in the table. Inside query if we want to use any kind of string, we use (""). 

The commit() function helps us in reflecting the changes in the database, like over here we are inserting a row to a table in the database.

Suppose the table contains a column marked as the primary key, then we should make sure the rules for assigning data into that column, otherwise we get an error.

In [6]:
cur.execute('Insert into Student values (102, "Amit", 19)')
db.commit()

Here we have added another row to the table

In [7]:
db.close()

Here we have closed our database. It is necessary to close a database after performing operations on it. It is a good practice. If we try to execute any command on the database after closing it, we get an error.

## Connect with database

In this lecture we try to perform few more operation on our SQLite database using our python code.

In [8]:
import sqlite3
db = sqlite3.connect('School.sqlite')
db

Opening our database created in the last lecture.

In [9]:
cur = db.cursor()
cur

In [10]:
cur.execute('Insert into Student values (103, "Mohit", 18)')
db.commit()

Inserting a new row to the table "Student".

In [11]:
rollNumber = 104
Name = "Nikhil"
Age = 19

cur.execute('Insert into Student values (?, ?, ?)', (rollNumber, Name, Age))
db.commit()

The above code is how to insert a row into the table when the values are present in some variables.

In [12]:
values = [(105, "Nidhi", 20), (106, "Manisha", 20), (107, "Ankush", 19)]
cur.executemany('Insert into Student values (?, ?, ?)', values)
db.commit()

In the above code we have inserted 3 new rows to the table "Student". By using the above process, we can insert multiple rows inside our table. The method used is executemany(). The rows should be a list of tuples.

In [13]:
cur.execute('Update Student set Age = 19')
db.commit()

We have performed an updation query. We have set the column 'Age' to 19, i.e. all the values in the 'Age' column has been replaced by 19 for each and every row.

In [14]:
cur.execute('Update Student set Age = 20 where RollNumber = 104')
db.commit()

We have set the value of the field "Age" = 20 for the row containing the value of the field "RollNumber" = 103

In [15]:
new_age = 20

cur.execute('Update Student set Age = ? where RollNumber = 103', (new_age,))  # We use "," to make it a tuple explicitly
db.commit()

Updation query where the value is stored in some variable. The value in this case should be passed in the form of a tuple, otherwise we get an error.

In [16]:
db.close()

## Fetch data

In this lecture, we will be seeing that how can we extract/fetch data from our SQLite database.

In [28]:
import sqlite3
db = sqlite3.connect('School.sqlite')
db

In [29]:
cur = db.cursor()
cur

In [19]:
cur.execute('Select * from Student')

In the above code we have passed the query to fetch all the rows present in the table "Student". After executing the command, we can treat the cursor object as an iterator and iterate over it to print the rows.

In [20]:
for row in cur:
  print(row)

(101, 'Aman', 19)
(102, 'Amit', 19)
(103, 'Mohit', 20)
(104, 'Nikhil', 20)
(105, 'Nidhi', 19)
(106, 'Manisha', 19)
(107, 'Ankush', 19)

In [21]:
cur.execute('Select * from Student')
cur.fetchone()

(101, 'Aman', 19)

There are 3 methods wth the help of withwe can fetch data from the table inside our database:

1) fetchone()

2) fetchmany()

3) fetchall()

We need to call these methods over our cursor object.

In [22]:
cur.execute('Select * from Student')   # We are extracting each and every row from the table from this command
cur.fetchone()

(101, 'Aman', 19)

We observe that we are getting our first row. The fetchone() method basically return the first row of our table.

In [23]:
cur.execute('Select * from Student')
print(cur.fetchone())
print(cur.fetchone())

(101, 'Aman', 19)
(102, 'Amit', 19)

Here we can see that we are getting multiple rows using the fetchone() method. Once a row is printed, the cursor moves to the next row, and this time, fetchone() method is called, the current row gets printed.

In [24]:
cur.execute('Select * from Student')
cur.fetchmany()

[(101, 'Aman', 19)]

By default, fetchmany() returns only 1 row (first row) if the number of rows is not passed into it.

In [25]:
cur.execute('Select * from Student')
print(cur.fetchmany(5))

[(101, 'Aman', 19), (102, 'Amit', 19), (103, 'Mohit', 20), (104, 'Nikhil', 20), (105, 'Nidhi', 19)]

Here we get 5 rows because we have passed n = 5 inside the fetchmany() function. This is how we can print multiple rows from our table.

In [26]:
cur.execute('Select * from Student')
ans = cur.fetchall()
ans

[(101, 'Aman', 19),
 (102, 'Amit', 19),
 (103, 'Mohit', 20),
 (104, 'Nikhil', 20),
 (105, 'Nidhi', 19),
 (106, 'Manisha', 19),
 (107, 'Ankush', 19)]

The method fetchall() is used for extracting all the rows from the table inside the database. 

We can fetch data for conditional queries using the above methods.

In [30]:
cur.execute('Select * from Student where RollNumber > 103')
print(cur.fetchall())

[(104, 'Nikhil', 20), (105, 'Nidhi', 19), (106, 'Manisha', 19), (107, 'Ankush', 19)]

In [31]:
cur.execute('Select * from Student where Name like "A%" ')
print(cur.fetchall())

[(101, 'Aman', 19), (102, 'Amit', 19), (107, 'Ankush', 19)]

In [32]:
db.close()

## SQLite with Pandas

In this lecture we will see how to  extract data from a SQLite database to a pandas dataframe.

In [33]:
import sqlite3
import pandas as pd

db = sqlite3.connect('School.sqlite')
db

To read the data in a pandas sataframe we need the function read_sql_query(). This function takes in 2 parametres - 

1) SQL Query

2) The database connection object (db in our case)

The data obtained from the databasecan be stored in some variable (data in our case)

In [35]:
data = pd.read_sql_query("Select * from Student", db)
data

   RollNumber     Name  Age
0         101     Aman   19
1         102     Amit   19
2         103    Mohit   20
3         104   Nikhil   20
4         105    Nidhi   19
5         106  Manisha   19
6         107   Ankush   19

This method has several advanttages. We don't need to create a cursor object here and we don't need to explicity call the methods like fetchone(), fetchmany(), fetchall()  to extract data.

With the help of a DataFrame, we can do operations over our data very easily.

In [36]:
data['Age'] == 20

0    False
1    False
2     True
3     True
4    False
5    False
6    False
Name: Age, dtype: bool

Suppose we want to get the rows where "Age" = 20. By executing the above code, we get a boolean array. We can pass this boolean array to our data frame to get the required rows.

In [37]:
data[data['Age'] == 20]

   RollNumber    Name  Age
2         103   Mohit   20
3         104  Nikhil   20

With the help of pandas we can create our new table also. Below, we are creating the table Faculty.

In [38]:
df = pd.DataFrame([[201, "Aman", "English", 20000], [202, "Komal", "Maths", 22000], [203, "Mahesh", "Science", 24000]], columns = ["Faculty_ID", "Name", "Course", "Salary"])
df

   Faculty_ID    Name   Course  Salary
0         201    Aman  English   20000
1         202   Komal    Maths   22000
2         203  Mahesh  Science   24000

In [39]:
df.to_sql("Faculty", db)

3

Converting the DataFrame to a table in the SQL database. The above code returns the number of rows in the new SQL table formed.

We can perform updation queries on the table using the dataframe.

In [40]:
data = pd.read_sql_query("Select * from Student", db)
data["Address"] = "New Delhi"
data

   RollNumber     Name  Age    Address
0         101     Aman   19  New Delhi
1         102     Amit   19  New Delhi
2         103    Mohit   20  New Delhi
3         104   Nikhil   20  New Delhi
4         105    Nidhi   19  New Delhi
5         106  Manisha   19  New Delhi
6         107   Ankush   19  New Delhi

Here we have converted the SQL tale Student to a pandas DataFrame, and over here, we have created the field "Address" with value "New Delhi".

After the updation, we reconvert the Dataframe to an SQL Table.

In [41]:
data.to_sql("Student", db, if_exists = "replace")

7

Here we replace the old version of the table "Student", with the updated version, using pandas DataFrame.

In [42]:
db.close()